[{"bio":["Alexandre Morgaut started out doing Web development in 1995 on Lynx, Mosaic and Netscape. He converted Java chatroom applets into pure \"Ajax\" before XHR was even available, and created many Flash-like Web interfaces in pure JavaScript. He designed and developed Web sites and Web applications at French TV channel TF1. Alexandre worked next to enhance Web technologies and Web Standards support in 4D application servers and IDEs (4D &amp; Wakanda platforms). Today as Community manager &amp; W3C Advisory Community member, his goal is to promote end-to-end JavaScript, NoSQL and REST as a powerful platform for even enterprise applications."],"body":"\nThere is many interesting platforms out there to develop Web applications, like .NET, Spring, ruby on rails, Django, LAMP, Meteor, and so on.\nIn this presentation, you will discover Wakanda a Model driven NoSQL / SSJS platform built on Web standards.\nYou will see how a project starts, can be designed, tested, developed by a team, debugged, administrated, maintained, and then how to update it in the future.\nWe will compare to some existing platforms and why Wakanda could make you more efficient.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/alexandre_morgaut-300x300.jpg","name":"Alexandre Morgaut","summary":"Alexandre Morgaut started out doing Web developmen","title":"From Web App Model Design to production with Wakanda","twitter":"http://twitter.com/amorgaut","website":"https://github.com/AMorgaut"},{"bio":["Professional software engineer at INVIQA, performing both front-end and back-end Web development on behalf of enterprise-level clients. A principal member of the #bbg IRC channel on Freenode, dedicated to all things browser-based game development.  Scout for Mozilla's WebFWD programme."],"body":"\nMy personal (not work) project for 2013 is the development of a game console OS for legacy PC hardware, dedicated primarily for the task of playing HTML5 games.\nI'd like to share with you my knowledge gained in implementing a bare bones Forth system for 32-bit x86 CPUs along with the internals of a high-level JavaScript interpreter.\nGetting to know what's happening behind the scenes, dos and don'ts, teething problems, debugging issues, etc.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/andrewbaker.png","name":"Andrew J. Baker","summary":"Professional software engineer at INVIQA, performi","title":"V45 - an HTML5 game console OS","twitter":"http://twitter.com/andrew_j_baker2","website":"https://github.com/andrewjbaker"},{"bio":["Andrzej is a front-end developer with a huge love for CSS, JavaScript addict strongly focusing on HTML5 games development. Part time blogger, newbie speaker, creator of the <a href=\"http://js13kgames.com/\" title=\"js13kGames Competition\">js13kGames</a> competition, founder of the <a href=\"http://enclavegames.com/\" title=\"Enclaves Games\">Enclave Games</a> HTML5 gamedev studio and <a href=\"http://gamedevjs.com/\" title=\"GameDev.js Meetup\">Gamedev.js Meetups</a> organizer.<br>\n<a href=\"http://github.com/end3r\" title=\"Andrzej on GitHub\">His GitHub account</a>"],"body":"\nThere's a new player in the mobile world - Firefox OS. You probably don't know him yet, but you already know his tools of the trade - HTML5 and JavaScript. What's so special about him? Well, if you're a front-end developer there's a huge chance you're already building Internets that can be used as an apps with almost no hassle. If you're into HTML5 game development I've got some good news for you.\nThis talk will be an introduction to the Firefox OS mobile system, the Mozilla Marketplace and a concept of developing mobile HTML5 games easily and getting a buck load of money out of it.\nAbusing Firefox OS and HTML5 games for fun and profit.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/andrzejmazur.jpg","name":"Andrzej Mazur","summary":"Andrzej is a front-end developer with a huge love ","title":"Abusing Firefox OS and HTML5 games for fun and profit","twitter":"http://twitter.com/end33r ","website":"http://dev.end3r.com/"},{"bio":["Bonjour,","So you guys probably know me, but if not, I'm Arnout Kazemier. An extraordanary JavaScript engineer from the Netherlands. I work at Nodejitsu as Lead Software engineer, I'm also contributor to the well known module \"Socket.IO\" as well as author of various of open source modules...","His <a href=\"http://github.com/3rd-Eden\" title=\"Arnout on GitHub\">GitHub</a>"],"body":"\nObserver is entry that won the Node Knockout 2011 in 3 different categories. In this talk I will give you insights on how I won the contest, how I build observer: the realtime stack, the front-end library and the node.js backend and the issues I faced while I was developing it. And last but not least ups and downs you could face when trying to transform your weekend project in a startup.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/arnout_kazemier-170x170.jpeg","name":"Arnout Kazemier","summary":"Bonjour,","title":"Observing observer","twitter":"http://twitter.com/3rdEden","website":"http://github.com/observing"},{"bio":["Bastian is a Software Engineer at ResearchGate, the social network for scientists, working there on everything API related. Before that he was responsible for the integration of OpenSocial, OAuth and OpenID into the largest german based social networks. He is also active in the OpenSocial foundation, a committer in the Apache Shindig project and a frequent speaker on international web technology conferences, always trying to promote open standards and protocols. You can find and follow him on Twitter <a href=\"http://twitter.com/BastianHofmann\" title=\"Bastian on Twitter\">Twitter</a>, Github  <a href=\"http://github.com/bashofmann\" title=\"Bastian on GitHub\">GitHub</a> or  <a href=\"http://lanyrd.com/profile/bastianhofmann/\" title=\"Bastian on Lanyrd\">Lanyrd</a>."],"body":"\nDo you know what is happening in your web application right now, this second, how many requests, logins, exceptions you have, how many and what data your users are generating and what the click through rate of each of your registration step is? Or do you know exactly which exception with which stack trace caused the error your users are seeing? If not, this talk will show how you can easily measure and log everything that happens in your application with the help of open source tools, such as Graphite, StatsD, Graylog2 and Logstash, without influencing your production environment.\nMeasuring and Logging Everything in Real Time\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/bastian_hofmann.jpg","name":"Bastian Hofmann","summary":"Bastian is a Software Engineer at ResearchGate, th","title":"Measuring and Logging Everything in Real Time","twitter":"http://twitter.com/BastianHofmann","website":"http://github.com/bashofmann"},{"bio":["Christophe is a Senior Software Engineer at IBM. Hi is a Dojo Toolkit committer with special focus on mobile and advanced visualization components. In addition to his toolkit contributions, he is leading the IBM Dojo effort. Before joining IBM, Christophe worked for ILOG for more than a decade leading the development of visualization components for the Web and representing ILOG on Web standardization groups such as the W3C SWG Working Group. ","His <a href=\"https://github.com/cjolif\" title=\"Christophe on GitHub\">GitHub</a>"],"body":"\nThis session will introduce the Dojo Toolkit and in particular Dojo Mobile. The presenter will then demonstrate how to create, step by step, a simple mobile application with Dojo Mobile and how to deploy it either as a Web or Hybrid application on mobile (phones & tablets) devices. We will then see how Dojo application framework could simplify the development of even more complex applications. Finally we will look into the future of mobile development with Dojo.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/cjolif-170x170.png","name":"Christophe Jolif","summary":"Christophe is a Senior Software Engineer at IBM. H","title":"Building Mobile Applications with the Dojo Toolkit","twitter":"http://twitter.com/cjolif","website":"https://github.com/cjolif"},{"bio":["With over 15 years of experience in development, Corinne is addicted to code and can’t go very far from it. Freelance since 1999, she traveled from C++ to Java, J2EE, Spring, Struts, JSP, Web 2.0 and naturally made her path to mobile apps. Being an Agile coach and practitioner, she thinks code is craft and collaboration is key to success.<br>\nChatting about the latest tech trends at coffee break: a female geek – what do you expect – she’s always curious to discover (or rediscover) languages and frameworks. She is co-founder of RivieraGUG (Grails and Groovy User Group) and an active member of JS Sophia: because there is no better way to achieve continuous learning than sharing ideas.","Fabrice is a Web architect in charge of code quality for a large organization (nickname Mr. Clean Code). With over 15 years of experience in bank, insurance, multimedia and travel industry all over the world, he is now spending his nights coding HTML5 mobile apps. Involved in a couple of open source projects and co-founder of RivieraGUG (Grails and Groovy User Group), you can always discuss with him about asynchronous behavior, Groovy and JavaScript over a couple of beers."],"body":"\nHybrid Mobile App in Minutes, Not Days\n(using Grails 3musket33rs plugin)\nIn minutes we will demonstrate how to develop TagMyFriends, a mobile hybrid web app (jQuery Mobile, PhoneGap) with a back-end on the cloud. This will cover offline caching, local storage, synchronization, Phone Gap build, geolocation and server side event push. At the end, we will have a clone of Foursquare on your mobile, with a backend in Grails.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/corinne_fabrice-170x85.jpg","name":"Corinne Krych &amp; Fabrice Matrat","summary":"With over 15 years of experience in development, C","title":"Hybrid Mobile App in Minutes, Not Days","twitter":"http://twitter.com/corinnekrych","website":"https://github.com/corinnekrych"},{"bio":["David est un artisan, un geek &amp; un citoyen.<br>\nHis <a href=\"https://github.com/davidbgk\" title=\"David on GitHub\">GitHub</a>","Vincent Agnano, après 8 ans de freelance en développement Web, s'est associé avec 3 pointures et, avec eux, a fondé Scopyleft. Il y travaille comme développeur Web maniaque en Python et Javascript.<br>\nHis <a href=\"http://github.com/vinyll\" title=\"Vincent on GitHub\">GitHub</a><br>\n@vinyll"],"body":"\nAvec l'arrivée de node.js, beaucoup de développeurs se demandent s'il est encore nécessaire d'apprendre un autre langage côté serveur. Il existe pourtant des frameworks plus matures qui sont également non bloquants dans d'autres langages.\nÀ travers l'exemple de Python, nous étudierons les divers scénarios possibles pour faire cohabiter ces 2 langages et discuter des concepts sous-jacents.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/david-larlet.jpg","name":"David Larlet et Vincent Agnano","summary":"David est un artisan, un geek &amp; un citoyen.<br","title":"JavaScript et Python : un duo de choc","twitter":"http://twitter.com/davidbgk","website":"https://larlet.fr/david/"},{"bio":["David Pilato is an Elasticsearch Technical Advocate and French User Group creator<br>\nIn his free time, he likes talking about Elasticsearch (Devoxx France 2012, JUGs, ...)<br>\nHis <a href=\"http://www.github.com/dadoonet/\" title=\"David on GitHub\">GitHub</a>","Tugdual Grall is a Couchbase Technical advocate<br>\nHe has been around the world a few times to give talks about CouchBase and NoSQL world (Devoxx France 2012, JUGs, ...)<br>\nHis <a href=\"http://www.github.com/tgrall/\" title=\"Tugdual on GitHub\">GitHub</a>"],"body":"\nDuring this \"live coding\" talk, Tugdual and David will move an old-fashion full SQL application to the NoSQL world.\nUsing CouchBase and Elasticsearch, they will show all gains you can have with this new architecture:\n- Easyness\n- Elasticity (scalablity)\nFollowing points will be covered:\n- Document Oriented Model\n- JSon\n- REST\n- Caching / Memcache\n- Filters and Facets\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/david_pilato-tugdual_grall.png","name":"David Pilato and Tugdual Grall","summary":"David Pilato is an Elasticsearch Technical Advocat","title":"Elastify your app : from SQL to NoSQL in less than one hour!","twitter":"http://twitter.com/dadoonet","website":"http://www.github.com/dadoonet/"},{"bio":["Manager Environments Unix Development, Testing and pre-production,<br>\nResponsible for live Batch on Oracle Retail Pro * C / Shell / Perl and Oracle PL / SQL, multi-tread system.<br>\nSenior Analyst Programmer in various languages​​, including OOP such as PHP, C++ and Java.<br>\nResponsible for validation, installation and deployment of all developments made ​​by internal and sourcing, and version control manager."],"body":"\nHistory of web and Linux application I made in past.\nStory about the construction of a web application for monitoring, support, improve and control of a large network of POS. Very large network in Linux, multi-servers, multi-POS in every server, all communications being over ssh.\nAnalysis, critical points, restrictions, design and development. Some examples will be shown.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/filipe_moura-170x184.jpg","name":"Filipe Moura","summary":"Manager Environments Unix Development, Testing and","title":"Web App as a multi large network manager","twitter":"http://twitter.com/supermoura ","website":"https://github.com/supermoura"},{"bio":["I help organisations execute cool ideas to fulfill their online dreams and ambitions. I specialize in agile web development and providing guidance through the software development process. At <a href=\"http://www.pragmatist.nl/\" title=\"Pragmatist\">Pragmatist</a>, we focus primarily on startups and IT departments.","I appreciate tech innovation, simple things that cause big changes, and lean thinkers and builders.","When I'm not building awesome stuff, I get involved in the tech community, play video games, browse the web, read books, and enjoy times with friends and family.","When you need to get things done, I'm your guy."],"body":"\nAOP is a programming paradigm that aims to separate supporting functionality (like logging or event triggering) from the business logic. In this talk I'll explain in more detail what AOP is, how we can apply it in PHP, and what kind of solutions are currently available.\nHis GitHub\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/frank_vdbrink-170x170.jpg","name":"Frank van den Brink","summary":"I help organisations execute cool ideas to fulfill","title":"Aspect Oriented Programming in PHP","twitter":"http://twitter.com/fvdb","website":"http://www.pragmatist.nl/"},{"bio":["Julien is an OSS architect working at BlaBlaCar in Paris. He has been engaged in PHP for 10 years, and is PHP 5.5 Release Manager. His work talks about Unix/Linux, PHP internals code and several other OSS. You can find him on twitter @julienpauli or <a href=\"http://github.com/jpauli\" title=\"Julien on GitHub\">GitHub</a>"],"body":"\nPHP is born in 1995. So many features and improvements have been added to the language since the PHP3 time !\nIn this talk, we will recall briefly PHP's history, present its contributors and eco-system, and detail where we are nowadays.\nPHP 5.5 will be at the heart of the conference, and we'll review together some new features it adds.\nWe'll also foresee how performance of the language have evolved throught the years.\nFinally, a chapter about \"does and donts\", or what to do and not to do with the PHP language.\nAt the end, you'll have a nice fresh idea of what PHP is, and how to use it in your everyday's projects.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/julienP-248x300.jpg","name":"Julien Pauli","summary":"Julien is an OSS architect working at BlaBlaCar in","title":"PHP in 2013","twitter":"http://twitter.com/julienpauli ","website":"http://github.com/jpauli"},{"bio":["Juozas, or as everyone calls him Joe, is an experienced and talented (some say) young professional, entrepreneur and evangelist. Focusing on bringing IT solutions to non-technical businesses, like retail, he works on optimizing their processes and using cutting-edge research to solve hard problems and grow sales. When not working, Joe finds time to contribute to open-source projects and movements to improve interoperability and platform independence. His hands-on practice with collection of different technologies, programming languages and environments allows him to deliver unbiased and practical presentations in all kind of different topics."],"body":"\nProcessing one billion database rows doesn't need to kill your web server. Really, it doesn't. Applying lazy evaluation ideas you can make your scripts handle as much data as there exists, never using more memory than one unit's size (for example a database row). Using clever iterators, cursors and streams I'll show you how you can reduce memory usage drastically, thus making your scripts more reliable and your sysadmins happy.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/profile5-133x200.jpg","name":"Juozas Kaziukėnas","summary":"Juozas, or as everyone calls him Joe, is an experi","title":"Process any amounts of data. Any time","twitter":"http://twitter.com/juokaz","website":"http://juokaz.com/"},{"bio":["Après avoir contribué pendant des années à coder des failles de sécurité, les parsemer dans diverses applications à travers le monde, je me suis décidé à récupérer mon investissement en apprenant à les exploiter."],"body":"\nLes injections sql sont un vecteur d'attaque des applications web et leur utilisation augmente. Elles sont méconnues et ignorées par les développeurs. Ce talk présente les différentes attaques, de l'injection sql classique à la blind et le faux sentiment de sécurité donné par les outils. Elle présente les outils pour s'entrainer, tester et faire de la veille.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/liochan-web5-170x153.png","name":"Lionel Chanson","summary":"Après avoir contribué pendant des années à coder d","title":"Injections sql ou 1=1 est plus que jamais True","twitter":"http://twitter.com/liochan","website":"https://github.com/ioO"},{"bio":["Lyle Troxell, Developer Advocate for Wakanda, is a teacher and advocate of JavaScript and open source development with an interest in photography, digital art, and new media. For the last 10 years Lyle has focused on supporting artists and hackers use techology to influence change in the world."],"body":"\nYou have many choices in front end frameworks, and you want to focus there, making the app feel great, look fantastic, and be responsive. Unfortunately there is always the other side: the server and the database.\nWakanda Server is an open-source server-side JS and a relational-noSQL database. Using Wakanda on the back end will allow you to focus on the good parts of your application development on the client-side.\nThis talk will show you the quick setup of your server side data model in JavaScript with WakandaDB and then a code-explained demonstration of using Dojo on the client side and a brief look at connecting Wakanda to Sencha, Backbone, and Angular.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/lyle-170x170.png","name":"Lyle Troxell","summary":"Lyle Troxell, Developer Advocate for Wakanda, is a","title":"Get the server-side out of the way with Wakanda","twitter":"http://twitter.com/lyle","website":"https://github.com/lyle"},{"bio":["A Javascript Pirate, father of two, meteoropathic and with an insane passion for lo-fi music.<br>\nFrontend developer since he was able to grow a beard, he worked for Yoox Group for 5 years and then, after 1 year with Spreaker.com, decided to move to London.<br>\nNow he is employed at Shazam, where he's currently using the experience of his years spent designing and maintaining clientside architectures, APIs and continuous integration processes.<br>\nHe is proudly involved in the organization of From The Front conferences."],"body":"\nHave you ever had the need to figure out how to survive a Javascript Zombiecodepocalipse? Have you ever dreamed about loads of living legacy code and the urge to run away from it? Hundreds of lines of code tightly coupled and hardly understandable there were trying to catch you?\nI've been there and I'm a survivor because I learned the art of refactoring.\nThis talk is about how to deal with features request, deadlines and still increase the maintainability of your code.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/marco-170x170.jpg","name":"Marco Cedaro","summary":"A Javascript Pirate, father of two, meteoropathic ","title":"Zombie Code","twitter":"http://twitter.com/cedmax","website":"https://github.com/cedmax"},{"bio":["I'm Marco Pivetta, a softwer developer that has been doing PHP for a decade and currently wastes his own free time on github as a doctrine project core contributor and generally on anything that is worth developing for fun!","His <a href=\"https://github.com/Ocramius\" title=\"Ocramius on GitHub\">GitHub</a>."],"body":"\nThe presentation will describe the reasons to use or not Doctrine 2 ORM and some basic\nfunctionalities available in the ORM. We'll be describing how to install and\nconfigure a Zend\\Mvc based applications for usage with doctrine, and also the\nfeatures provided by DoctrineModule, such as:\n* Validators\n* Authentication\n* Forms\n* Caching\n* Pagination\n* CLI Tools\n* Integration with Zend Developer Tools\nWe will also cover many best-practices and common mistakes you may encounter while\ndeveloping applications based on the ORM.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/ocramius-170x170.jpeg","name":"Marco Pivetta","summary":"I'm Marco Pivetta, a softwer developer that has be","title":"Doctrine 2 ORM and Zend Framework 2: an introduction to DoctrineModule","twitter":"http://twitter.com/Ocramius","website":"https://github.com/Ocramius"},{"bio":["Martin Shwalbe is a Senior Software developer with focus on PHP since nearly 12 years. I am an open Source contributor and leading the development of the  community website modules.zendframework.com for Zend Framework 2. I also blog about various topics on <a href=\"http://hounddog.github.com\" title=\"Martin's Blog\">my blog</a>."],"body":"\nToday we need to be able to deliver new Software updates in a fast and secure way. Customers will no longer wait for a certain release schedule. This presentation will demonstrate how you can integrate continuous integration/development in your current development cycle.\n- Integrating Automated tests and code coverage\n- Automatic Deployment of Software updates\n- Branching Strategies for git\n- Security Controls in Automated Deployment\n- Non-Destructive Upgrades of Database Schema\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/martin_shwalbe-170x170.jpg","name":"Martin Shwalbe","summary":"Martin Shwalbe is a Senior Software developer with","title":"Continuous Deployment","twitter":"http://twitter.com/mshwalbe","website":"http://hounddog.github.com"},{"bio":["Being one of the very first expert in France (2004), Matthieu Faure is since a recognized web accessibility professional.<br>\nHe created Tanaguru, a free-libre software and also an online service, to enhance accessibility and SEO. He's also launched KBAccess (collaborative website gathering bad and good examples of accessibility), and the french Observatoire de l'accessibilité, measuring accessibility level of a bunch of 1500 websites.<br>\nTodays, he heads <a href=\"http://www.open-s.com/\" title=\"Open-S Company\">Open-S</a>, the editor of Tanaguru and recognized as Young Innovative Company for its research work."],"body":"\nAs web apps become mainstream, web developers tend to use more Javascript than plain old HTML. Consciousness of web accessibility is more and more present, and as a legal requirement, it tends to be ubiquitous. However, mixing Javascript and accessibility is not so easy, nor the associated tests. After a brief overview of what accessibility is (and is not !), we'll see how to bring it into the day-to-day developer's life.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/mfaure.jpg","name":"Matthieu Faure","summary":"Being one of the very first expert in France (2004","title":"Accessibility: automated testing of Javascript","twitter":"http://twitter.com/OpenSCompany","website":"http://www.open-s.com/"},{"bio":["Morten is a lead developer at RemoteX Technologies, where he has been developing offline capable business applications for the last 5 years.<br>\nHe is a .Net developer with a fot in UNIX development, and enjoys programming in different languages.<br>\nHe is passionate about SOLID­design principles, testing, automation, and good food.","<a href=\"http://www.morkeleb.com\" title=\"Morten's Website\">Morten's Website</a>"],"body":"\nRoy Fielding introduced REST in a paper in 2000. For some that ancient wisdom is a religious bible meant to be followed in the purest of ways.\nBut technologies have changed since then, clients share and shape data differently, and no besides what fun is it if we dont break a few rules.\nLets examine what we when we mix in a few concepts from other topics such as CQRS to achieve javascript clients that:\ncan be remote controlled, easily tested, allow experimentation, and efficiently synchronize data.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/morten-e1361551616681-170x186.png","name":"Morten Nielsen","summary":"Morten is a lead developer at RemoteX Technologies","title":"Breaking REST rules - experiences from a heretic REST api","twitter":"http://twitter.com/morten_ni","website":"https://github.com/morkeleb"},{"bio":["Freelancer, worked at isohunt. Co-founder of shapado.com that is also open source at <a href=\"https://github.com/ricodigo/shapado\" title=\"Shapado\">Shapado</a> and I'm the author of the AngularJS scaffold for rails <a href=\"https://github.com/patcito/angularjs_scaffold\" title=\"AngularJS Scaffold for Rail\">https://github.com/patcito/angularjs_scaffold</a> (&gt;+100 stars and I even got a t-shirt from Google for it!). ","His <a href=\"https://github.com/patcito\" title=\"Patrick on GitHub\">GitHub</a>"],"body":"\nI will first introduce the concepts of AngularJS and then do a live coding session demonstrating some of these concepts. The live coding demo is the one typically done by the AngularJS guys at there confs (a fancy todo app using AngularJS cool features). I will also talk about how to make Angular work well in a real world app.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/patcito-170x170.jpg","name":"Patrick Aljord","summary":"Freelancer, worked at isohunt. Co-founder of shapa","title":"Introduction to AngularJS","twitter":"http://twitter.com/patcito","website":"https://github.com/patcito"},{"bio":["My strong interest in new technologies led me to study at the EPITA computer science school. Afterwards, my first experiences mainly involved heavy client software development using Delphi and Firebird databases.<br>\nNonetheless, working on e-commerce integration and web oriented business software let me the possibility to switch to web development using PHP and MySQL.<br>\nNowadays, I still mostly work with LAMP environments. However, the last few years brought huge enhancements to web standards, and the emergence of smart mobile devices has been such that they are everywhere around us.<br>\nIndeed, my interest was pushed in designing cross-platform solutions  promoting code reuse and homogeneity. I strongly believe that JavaScript environments have now grown such a way that their use can be a great opportunity to reach these goals, and build self-contained applications.<br>\nAs a result, I recently got involved in a commercial software project that follows these principles and can be used both on desktop and mobile devices.<br>\nI'm a software engineer at Hinnoya."],"body":"\n* Introduction : How enyo 2 emerged as a sequel of WebOS, the first production-ready javascript OS.\n* Design overview : patterns and common sense from a real experience with mobile devices:\n- Kinds (object inheritance), published properties, MVVM, general project organization.\n* Essential components overview:\n- Enyo (layout), Onyx (widgets), g11n (localization), less (themes).\n* Diving into the bootplate.\n* Manipulating data.\n* Deploying to multiple devices using Apache Cordova.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/PICT3928.png","name":"Philippe Sam-Long","summary":"My strong interest in new technologies led me to s","title":"Enyo 2, a javscript framework designed for mobile diversity","twitter":"http://twitter.com/pulsati0n","website":"https://github.com/pulsation"},{"bio":["Appartient à la grande famille des Intégrateurs du Dimanche. Créateur et administrateur du site Alsacreations.com, communauté libre d'apprentissage web spécialisée dans les standards. Co-fondateur et co-gérant de l'agence web Alsacreations.fr. Expert et Formateur en langages HTML et CSS.<br>\nAuteur de divers livres techniques chez Eyrolles: \"CSS avancées, vers HTML5 et CSS3\", \"CSS2, Pratique du design web\", et des Mementos XHTML, CSS2 et CSS3."],"body":"\nVous êtes concepteur web ? Genre un vrai de vrai ? Vous êtes presque l’inventeur du Responsive Web Design et pensez que le Web mobile n’a plus de secret pour vous ?\nJe vous propose pourtant de découvrir une poignée de subtilités encore méconnues, même de vous !\nOn évoquera le media handheld, les tailles d’écran, les valeurs de pixels indépendants, le retina, @viewport en CSS, la meta width=device-width, l’accélération matérielle, les unités nouvelles telles que vw, vh, ou encore dpi, dppx, etc.\nSoyons joueurs et faisons un pari : si vous n’avez rien appris pendant cette présentation, je vous paye une bière alsacienne (ou un jus de kiwi) !\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/raphael_goetter.jpg","name":"Raphaël Goetter","summary":"Appartient à la grande famille des Intégrateurs du","title":"Web mobile : 10 trucs que vous ne connaissez peut-être pas","twitter":"http://twitter.com/goetter","website":"http://www.alsacreations.fr"},{"bio":["I'm a designer &amp; front-developer (mainly HTML and CSS, I tend to avoid JS when possible) I have specialized since 3 years in mobile design : UI and UX for native apps and also responsive webdesign (design and code).<br>\nI also design and code WordPress templates. And I like to write article and tuts about what I do  (<a href=\"http://tympanus.net/codrops/author/stephanie/\" title=\"Stéphanie on Tympanus\">Tympanus</a>, <a href=\"http://www.noupe.com/author/stephanie-walter\" title=\"Stéphanie on Noupe\">Noupe</a> and <a href=\"http://www.onextrapixel.com/author/stephanie-walter/\" title=\"Stéphanie\" on=\"\" onextrapixel\"\"=\"\">OnExtraPixel</a> )<br>\nI work as a designer and front-dev at alsacreations and have my own freelance design studio <a href=\"http://www.inpixelitrust.fr\" title=\"InPixelITrust\">inpixelitrust.fr</a>"],"body":"\nI recently worked on a big project, the client insisted on using bootstrap (no I won't talk about it) and LESS.\nHe basically wanted elements to be easily re-usable, and he also wanted us to create a \"template\" stylesheet with colors, background, so that he could easily popose different \"sets\" of color for the site. We got the PSDs from the designer, basically it was a headhache to code.\nThe client wanted us to re-use as many CSS as possible, to create variables with colors, to create different blocks that he could use on other pages. But the designer used so many colors, gradients, font-size, box size that is was basically almost impossible to re-use the CSS, we ended up designing each block as a custom block.\nAs a designer who codes, I was used to code my own template, this was the first time I coded an other designer work. I learnt a lot during this project, as a front-dev, but mainly as a designer.\nI learnt how to drive a front-dev crazy. And I want to share this with you. I want to share best practices, based on this project's experience, among other so that designers can create designs that are aimed to be coded using OOCSS methods. So that the code will be re-usable. And I also love nice HTML, and accessible websites.\nSo those advices and best practise will also include some UX and accessibility common ground and best practise.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/stephanie_walter-300x300.jpg","name":"Stéphanie Walter","summary":"I'm a designer &amp; front-developer (mainly HTML ","title":"Design best practice for a re-usable CSS - your front devs will say thanks","twitter":"http://twitter.com/walterstephanie","website":" https://github.com/inpixelitrust"},{"bio":["Enterprise Dojo Consultant.<br>\nWorked for IBM for 5 years across a range of technologies. Have been working Freelance for the last two years.<br>\nSpecialising in Dojo for the last 3 years, I have worked across a range of enterprise Dojo projects using a wide array of architectures.  I have been luckily enough to work from greenfield across the entire development process on several occasions.<br>\nI am currently working as Web Applications Tech Lead for Thomson Reuters in London."],"body":"\nA talk covering Widget design and structure in an enterprise environment.\nI plan to bring examples of team structures and issues faced from my experience of the last 4 large enterprise level Dojo projects I have worked on.\n# How the wireframe happened\nTouching on user stories and requirements gathering.\nUX Designers working alongside product owners.\n# What is a wireframe and where does it sit?\nWhat information is the wireframe conveying?\nWhat should be expected from a wireframe.\nWireframes are not pixel perfect.\nStarting point for UI conversations\n# Managing scope\nAttending design meetings where possible and managing attendees.\nOrganising and sticking to meeting agendas.\nKnowing your pallette of available components.\nUnderstanding you architecture.\nPushing back on costly design decisions.\n# Identifying widgets\nSplitting wireframes up into functional widgets.\nLogical groupings.\nSeperation of workload.\n# Identifying big widgets\nController widgets and widgets that manage business rules and logic.\nMade up of smaller custom widgets.\nand more...\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/03/tom_dye-160x200.jpg","name":"Tom Dye","summary":"Enterprise Dojo Consultant.<br>\nWorked for IBM for","title":"Wireframes to Widgets","twitter":"http://twitter.com/tmdye","website":"https://github.com/Tomdye"},{"bio":["Tugdual \"Tug\" Grall is a Technical Evangelist at Couchbase, an open source advocate and a passionate developer. He currently works with the European developer communities to ease the NoSQL adoption. Tugdual is contributing to the Java and Node/JavaScript Couchbase SDKs.","Before joining Couchbase Tugdual was CTO of eXo the company behind the revolutionary online development tools Cloud-IDE and the open source social platform eXo Platform. Earlier Tugdual has work as Product Manager and Developer on the Oracle Middleware focusing on Java EE platform.","Tug has spoken at number of conferences including Devoxx, Open Source Day Poland, Google I/O, JavaOne and many meetups and user groups. He is co-founder of the Nantes JUG (Java User Group) that holds since 2008 monthly meeting about Java ecosystem. He also writes a blog available at <a href=\"http://tugdualgrall.blogspot.com\" title=\"Blog de Tug\">http://tugdualgrall.blogspot.com</a> and available @tgrall Finally when he finds the time to do it, he develops the site <a href=\"http://www.resultri.com\" title=\"Blog de Tug\">www.resultri.com</a> a Google App Engine based application.","<a href=\"https://github.com/tgrall\" title=\"GitHub de Tug\">https://github.com/tgrall</a>"],"body":"\nYou are getting ready to build a new webapp, but things are different this time. In the past, your number of users was certainly big, but this new app will be five to ten times the size and will need to support not just the browser, but mobile apps and be ready to deploy in both Europe and Asia in six months. Thinking about how you'll hit these requirements, you've started to look into that new area of NoSQL. The options are many, but for the kind of interactive webapp you're looking to build, Couchbase Server looks pretty interesting. For instance, Draw Something scaled their mobile game to 50 million users in 50 days with Couchbase...\nCouchbase Server, Open Source under an Apache 2.0 license, is built to be the scale-out data store behind the kinds of applications that want simplified development, high throughput and low latency and may need to scale at a moment's notice. Developers can store either JSON objects or binary data directly into a Couchbase Server cluster and are abstracted away from the details of managing how data is spread across the cluster.\nIn this session, Tug Grall of Couchbase will provide a quick overview of Couchbase Server and then demonstrate growing a live cluster. He'll then give a quick overview of how simple it is to develop an application for Couchbase, covering the simplified schema-less approach, definition of views using map reduce and use of the Couchbase SDKs to access the cluster. Tug will include demonstration of Web applications developed in Java, Ruby, Node or other languages depending of the audience.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/tugdual_grall.png","name":"Tugdual Grall","summary":"Tugdual \"Tug\" Grall is a Technical Evangelist at C","title":"Getting Started with Couchbase Applications Development","twitter":"http://twitter.com/tgrall","website":"http://tugdualgrall.blogspot.com"},{"bio":["I have been passionate about testing since 2004 and have worked with test on a bunch of different products, using both manual and automated testing. I also hold a course in Agile Testing and have held several seminars on this topic as well as the Pomodoro Technique and Specification by Example.  ","I do have a <a href=\"https://github.com/Natook\" title=\"Ulrika on GitHub\">Github</a> account, but I use it to keep some of my presentations under version control (I like doing html presentations for that purpose)"],"body":"\nYou’re an expert programmer, you take the craftmanship of producing code seriously. On top of that, you spend your weekends at hackathons and your github repo is bustling. What else could you do to make your product more successful? Bring in a tester! Not just any old grumpy, pessimistic, bug obsessed kind of QA, but a real tester. One who will help your team push the quality of your product and your code.\nJoin this session to find out how a good tester will make you look even better and your software even more awesome. Ulrika will also share some of the tester’s tricks of the trade which you can use right away.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/ulrika_200px-170x186.jpg","name":"Ulrika Malmgren","summary":"I have been passionate about testing since 2004 an","title":"Amplify your awesomeness with testing","twitter":"http://twitter.com/Ulrikama","website":"https://github.com/Natook"},{"bio":["I'm a (mostly) front-end developer working at Hull (hull.io), in charge of architecting our JS stack, and open-sourcing it.<br>\nI'm a fierce advocate of JS, and have spent much time and energy lately studying the core features of Harmony, working on static analysis tool and giving a hand on the soon-to-be released complete rewrite of Aura."],"body":"\nThis talk will give an overview of tools and techniques that \"hurt your feelings\".\nNot only linting, which we already know, love and use (hopefully!), but also:\n* code coverage\n* branch coverage\n* execution shares\n* cyclomatic complexity\n* copy-paste detection\n* \"mess\" detection\nand how these tools, alongside with testing and building tools, will help devs build a better product, whether it is a library, framework, service or application.\n","img":"http://conf2013.web-5.org/wp-content/uploads/2013/02/xcambar-170x170.jpg","name":"Xavier Cambar","summary":"I'm a (mostly) front-end developer working at Hull","title":"Tools that tell about you","twitter":"http://twitter.com/xcambar","website":"https://github.com/xcambar"}]
